In [1]:
import pandas as pd
import numpy as np

# Creando un DataFrame

In [2]:
df = pd.read_csv('./mastermind.csv', index_col=[0])

In [3]:
df

           nombre         especialidad  edad  visitas sexo
0       SFDX Show             Hardware    30   130855    H
1     Sara Nogark     Edición de vídeo    29   114175    M
2    Nate Gentile         Programación    31   142545    H
3       Bettatech         Programación    31   149462    H
4  Antonio Sarosi  Sistemas Operativos    28   132008    H
5      Edgar Pons             Robótica    29   143620    H
6         s4vitar              Hacking    28   132567    H

In [4]:
datos = {'nombre': list(df['nombre']), 'especialidad': list(df['especialidad']), 'edad': [np.random.randint(24, 31) for i in range(len(df['nombre']))], 
        'visitas': [np.random.randint(24, 31000) for i in range(len(df['nombre']))]}

In [5]:
datos

{'nombre': ['SFDX Show',
  'Sara Nogark',
  'Nate Gentile',
  'Bettatech',
  'Antonio Sarosi',
  'Edgar Pons',
  's4vitar'],
 'especialidad': ['Hardware',
  'Edición de vídeo',
  'Programación',
  'Programación',
  'Sistemas Operativos',
  'Robótica',
  'Hacking'],
 'edad': [27, 28, 30, 24, 25, 26, 24],
 'visitas': [21020, 21015, 28871, 29808, 28150, 29579, 5248]}

In [6]:
df_inventado = pd.DataFrame(datos)
df_inventado

           nombre         especialidad  edad  visitas
0       SFDX Show             Hardware    27    21020
1     Sara Nogark     Edición de vídeo    28    21015
2    Nate Gentile         Programación    30    28871
3       Bettatech         Programación    24    29808
4  Antonio Sarosi  Sistemas Operativos    25    28150
5      Edgar Pons             Robótica    26    29579
6         s4vitar              Hacking    24     5248

In [7]:
df_inventado['sexo'] = ['H', 'H', 'M', 'H', 'H', 'M', 'H']

In [8]:
df_inventado

           nombre         especialidad  edad  visitas sexo
0       SFDX Show             Hardware    27    21020    H
1     Sara Nogark     Edición de vídeo    28    21015    H
2    Nate Gentile         Programación    30    28871    M
3       Bettatech         Programación    24    29808    H
4  Antonio Sarosi  Sistemas Operativos    25    28150    H
5      Edgar Pons             Robótica    26    29579    M
6         s4vitar              Hacking    24     5248    H

# Explorando un DataFrame

## df.head()

In [9]:
df.head(3)

         nombre      especialidad  edad  visitas sexo
0     SFDX Show          Hardware    30   130855    H
1   Sara Nogark  Edición de vídeo    29   114175    M
2  Nate Gentile      Programación    31   142545    H

## df.tail()

In [10]:
df.tail(4)

           nombre         especialidad  edad  visitas sexo
3       Bettatech         Programación    31   149462    H
4  Antonio Sarosi  Sistemas Operativos    28   132008    H
5      Edgar Pons             Robótica    29   143620    H
6         s4vitar              Hacking    28   132567    H

## df.sample()

In [11]:
df.sample(2)

      nombre especialidad  edad  visitas sexo
0  SFDX Show     Hardware    30   130855    H
6    s4vitar      Hacking    28   132567    H

## df.info()

In [12]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 7 entries, 0 to 6
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   nombre        7 non-null      object
 1   especialidad  7 non-null      object
 2   edad          7 non-null      int64
 3   visitas       7 non-null      int64
 4   sexo          7 non-null      object
dtypes: int64(2), object(3)
memory usage: 336.0+ bytes

## df.describe()

In [13]:
df.describe()

            edad        visitas
count   7.000000       7.000000
mean   29.428571  135033.142857
std     1.272418   11590.990631
min    28.000000  114175.000000
25%    28.500000  131431.500000
50%    29.000000  132567.000000
75%    30.500000  143082.500000
max    31.000000  149462.000000

## df.shape

In [14]:
df.shape

(7, 5)

## df.columns

In [15]:
df.columns = ['nombre', 'especialidad', 'viejo', 'visitas', 'sexo']

In [16]:
df

           nombre         especialidad  viejo  visitas sexo
0       SFDX Show             Hardware     30   130855    H
1     Sara Nogark     Edición de vídeo     29   114175    M
2    Nate Gentile         Programación     31   142545    H
3       Bettatech         Programación     31   149462    H
4  Antonio Sarosi  Sistemas Operativos     28   132008    H
5      Edgar Pons             Robótica     29   143620    H
6         s4vitar              Hacking     28   132567    H

## df.index

In [17]:
df.index

Int64Index([0, 1, 2, 3, 4, 5, 6], dtype='int64')

# Seleccion de elementos (Subset)

## Acceso mediante etiquetas

In [18]:
df.head()

           nombre         especialidad  viejo  visitas sexo
0       SFDX Show             Hardware     30   130855    H
1     Sara Nogark     Edición de vídeo     29   114175    M
2    Nate Gentile         Programación     31   142545    H
3       Bettatech         Programación     31   149462    H
4  Antonio Sarosi  Sistemas Operativos     28   132008    H

In [19]:
df[df['nombre'] == 'Nate Gentile']['especialidad']

2    Programación
Name: especialidad, dtype: object

In [20]:
mas_viejos = df[df['viejo']==29]['nombre']

## df.iloc[]

In [21]:
df.iloc[3,2]

31

In [22]:
df.iloc[2,0:2]

nombre          Nate Gentile
especialidad    Programación
Name: 2, dtype: object

## df.loc()

In [23]:
df.loc[2, ['especialidad','visitas']]

especialidad    Programación
visitas               142545
Name: 2, dtype: object

# Manipulacion de Datos

## Cambiar indice

### df.set_index()

In [24]:
df.set_index('nombre', inplace=True)

In [25]:
df

                       especialidad  viejo  visitas sexo
nombre
SFDX Show                  Hardware     30   130855    H
Sara Nogark        Edición de vídeo     29   114175    M
Nate Gentile           Programación     31   142545    H
Bettatech              Programación     31   149462    H
Antonio Sarosi  Sistemas Operativos     28   132008    H
Edgar Pons                 Robótica     29   143620    H
s4vitar                     Hacking     28   132567    H

In [26]:
df.reset_index()

           nombre         especialidad  viejo  visitas sexo
0       SFDX Show             Hardware     30   130855    H
1     Sara Nogark     Edición de vídeo     29   114175    M
2    Nate Gentile         Programación     31   142545    H
3       Bettatech         Programación     31   149462    H
4  Antonio Sarosi  Sistemas Operativos     28   132008    H
5      Edgar Pons             Robótica     29   143620    H
6         s4vitar              Hacking     28   132567    H

## df.apply()

In [27]:
df.select_dtypes(include='int')

                viejo  visitas
nombre
SFDX Show          30   130855
Sara Nogark        29   114175
Nate Gentile       31   142545
Bettatech          31   149462
Antonio Sarosi     28   132008
Edgar Pons         29   143620
s4vitar            28   132567

In [28]:
df.select_dtypes(include='int').apply(np.sqrt)

                   viejo     visitas
nombre
SFDX Show       5.477226  361.738856
Sara Nogark     5.385165  337.897914
Nate Gentile    5.567764  377.551321
Bettatech       5.567764  386.603156
Antonio Sarosi  5.291503  363.329052
Edgar Pons      5.385165  378.972295
s4vitar         5.291503  364.097514

In [30]:
df['especialidad mayus'] = df['especialidad'].apply(lambda x: x.upper())

In [31]:
df

                       especialidad  viejo  visitas sexo   especialidad mayus
nombre
SFDX Show                  Hardware     30   130855    H             HARDWARE
Sara Nogark        Edición de vídeo     29   114175    M     EDICIÓN DE VÍDEO
Nate Gentile           Programación     31   142545    H         PROGRAMACIÓN
Bettatech              Programación     31   149462    H         PROGRAMACIÓN
Antonio Sarosi  Sistemas Operativos     28   132008    H  SISTEMAS OPERATIVOS
Edgar Pons                 Robótica     29   143620    H             ROBÓTICA
s4vitar                     Hacking     28   132567    H              HACKING

## df.drop()

In [32]:
df.drop('especialidad mayus', inplace=True, axis=1)

## df.drop_duplicates()

In [33]:
new_df = df.copy()

In [36]:
new_df.drop_duplicates('viejo', keep='last')

            especialidad  viejo  visitas sexo
nombre
SFDX Show       Hardware     30   130855    H
Bettatech   Programación     31   149462    H
Edgar Pons      Robótica     29   143620    H
s4vitar          Hacking     28   132567    H

## df.nlargest()

In [40]:
df.nlargest(3, 'visitas')

              especialidad  viejo  visitas sexo
nombre
Bettatech     Programación     31   149462    H
Edgar Pons        Robótica     29   143620    H
Nate Gentile  Programación     31   142545    H

### df.sort_values()

## df.nsmallest()